MHYeung/ESP32S3_2.8LCD_touch_tryout/sdkconfig.defaults
# TinyUSB: enable MSC (Mass Storage) for USB drive mode
CONFIG_TINYUSB_MSC_ENABLED=y
# No CDC when MSC is active (avoids "disk not showing" issue)
CONFIG_TINYUSB_CDC_ENABLED=n

CONFIG_IDF_TARGET="esp32s3"

# Live-screen captions. Primary/secondary numbers come from custom tabular fonts.
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_20=y

# Keep a few built-in sizes for menus/settings until size-components says they are unused.
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_LV_MEM_SIZE_KILOBYTES=80
CONFIG_LV_USE_SLIDER=y

# Do not compile LVGL examples/demos into the firmware (flash + missing fonts).
# CONFIG_LV_BUILD_EXAMPLES is not set
# CONFIG_LV_BUILD_DEMOS is not set

# Do not enable PSRAM merely to mask an inefficient UI.
# CONFIG_SPIRAM is not set

# NimBLE central for the C3 tracker pod. Observer+central only — no advertising.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
# CONFIG_BT_NIMBLE_ROLE_PERIPHERAL is not set
# CONFIG_BT_NIMBLE_ROLE_BROADCASTER is not set
CONFIG_BT_NIMBLE_GATT_CLIENT=y
# CONFIG_BT_NIMBLE_GATT_SERVER is not set
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1
CONFIG_BT_NIMBLE_MAX_CCCDS=4
# CONFIG_BT_NIMBLE_SECURITY_ENABLE is not set
CONFIG_BT_NIMBLE_PINNED_TO_CORE_1=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=23
